<?php

use Illuminate\Database\Seeder;
use Faker\Factory as Faker;
use Carbon\Carbon;
use Illuminate\Support\Facades\Storage;
class PlaceTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('places')->insert([
            'place_name_th' => 'วัดเด่นสะหลีศรีเมืองแกน',
            'place_name_eng' => 'Wat Banden',
            'place_address' => 'ตำบล อินทขิล อำเภอ แม่แตง เชียงใหม่ 50150',
            'place_detail' => '<p>วัดบ้านเด่น ตั้งอยู่ใน ตำบลอินทขิล อำเภอแม่แตง จังหวัดเชียงใหม่ เพราะเป็นวัดที่ตั้งอยู่บนเนินเตี้ยๆ และใต้เนินนั้นเป็นถ้ำศักสิทธิ์ที่ ชาวบ้านพากันนับถือ จึงเรียกวัดนี้กันว่า &ldquo;วัดบ้านเด่น&rdquo; นอกจากจะแวดล้อมด้วยภูมิทัศน์ที่สวยงามแล้ว ที่ตั้งของวัดยังอยู่ในเขตเมือง เก่าโบราณที่เรียกว่า เมืองแกน ชาวบ้านเลยเรียกชื่อวัดนี้เต็มๆ ว่า "วัดเด่นสะหรีศรีเมืองแกน" เป็นต้นมา</p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/วัดบ้านเด่น/1-1.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/วัดบ้านเด่น/1-2.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/วัดบ้านเด่น/1-3.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/วัดบ้านเด่น/1-4.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/วัดบ้านเด่น/1-5.jpg" alt="" /></p>',
            'place_lat' => 19.157197,
            'place_lng' => 98.979456,
            'place_cover' => 'Cover-2017-12-20-5a394a24001c9-Cover-1.jpg',
            'place_tagline' => 'เกิดจากแรงศรัทธาในเรื่องของศาสนาและความเชื่อต่าง ๆ ซึ่งก่อให้เกิดสิ่งที่น่าอัศจรรย์แก่ผู้ที่มาเยือนและผู้พบเห็น สาเหตุที่กล่าวเช่นนี้ก็เพราะว่า แต่เดิมวัดแห่งนี้เป็นเพียงวัดเล็ก ๆ เท่านั้น',
//            'place_tag' => 'วัดบ้านเด่น',
            'place_publishby' => 1,
            'place_status' => 1,
            'place_reader' => 50,
            'place_search' => 25,
            'place_switch' => 1,
            'created_at' => '2017-12-18 16:04:05',
            'updated_at' => Carbon::now(),
        ]);

        DB::table('places')->insert([
            'place_name_th' => 'พิพิธภัณฑ์แหล่งเตาเผาอินทขิลเมืองแกน',
            'place_name_eng' => 'Archaeological Site Museum',
            'place_address' => 'บ้านสันป่าตอง หมู่ 11, ตำบลอินทขิล อำเภอแม่แตง จังหวัดเชียงใหม่, 50150',
            'place_detail' => '<p>จากการขุดพบแหล่งเตาเผาอินทขีลคือการค้นพบครั้งสำคัญในด้านวิชาการต่อวงการโบราณคดี ที่นี่จึงเป็นแหล่งเรียนรู้ประวัติศาสตร์ล้านนาที่ไม่ควรพลาด และด้วยความที่แหล่งผลิตถ้วยชามในอดีตแห่งนี้ มีความสมบูรณ์ทั้งเตาเผา และตัวอย่างเศษถ้วยชามที่มีมากถึง 4 แห่ง และยังไม่เคยพบความสมบูรณ์ จากแหล่งโบราณคดีใดในภาคเหนือเท่านี้มาก่อนเลย คงไม่มีสถานที่ใดอีกแล้วที่จะทำให้คุณได้เรียนรู้ การทำเครื่องปั้นดินเผาแบบโบราณได้อย่างเต็มอิ่ม แหล่งเตาเผาอินทขิลนั้นมีประวัติศาสตร์ความเป็นมา ที่ยาวนานหลายร้อยปี ในสมัยก่อนบริเวณนี้เป็นชุมชนโบราณที่ก่อตั้งมาตั้งแต่สมัยอาณาจักรล้านนาในช่วง พ.ศ.1801 ถึง พ.ศ.1854 และการขุดค้นพบแหล่งเตาเผาอินทขิลนั้นยังเป็นการยืนยันว่า "ทุ่งพันแอกพันเฝือเมืองแกน" ที่มีมาตั้งแต่สมัยพญามังราย (พ.ศ.1801-1854) นั้น มีอยู่จริงตามประวัติศาสตร์ล้านนา นอกจากนี้ยังมีการสันนิษฐานอีกว่าบริเวณบ้านสันป่าตองน่าจะเคยเป็นแหล่งผลิตเครื่องปั้นดินเผา
แหล่งใหญ่ของล้านนาที่มีอายุระหว่าง 500-600 ปี และคาดว่าแหล่งเตาเผานี้ถูกสร้างและใช้งานในราวปี พ.ศ.1950-2000 เพราะถ้วยชามที่ถูกค้นพบนั้น ส่วนใหญ่เป็นเครื่องถ้วยชามเนื้อแกร่ง เคลือบสีเขียวอ่อน เซลาดอน หรือ ศิลาดล และชนิดเคลือบสีน้ำตาล โดยใช้ดินสีขาวคุณภาพเยี่ยมเทียบได้กับเครื่องถ้วยชามสังคโลกของศรีสัชนาลัย และเครื่องถ้วยชามที่ผลิตจากเตาพาน จังหวัดเชียงรายเลยทีเดียว ที่สำคัญยังพบชิ้นส่วนภาชนะดินดิบที่ปั้นจากดินสีขาว ซึ่งยังไม่เคยพบในแหล่งเตาโบราณที่ใดมาก่อนในประเทศไทย</p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/พิพิธภัณฑ์แหล่งเตาเผาอินทขิลเมืองแกน/2-1.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/พิพิธภัณฑ์แหล่งเตาเผาอินทขิลเมืองแกน/2-2.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/พิพิธภัณฑ์แหล่งเตาเผาอินทขิลเมืองแกน/2-3.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/พิพิธภัณฑ์แหล่งเตาเผาอินทขิลเมืองแกน/2-4.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/พิพิธภัณฑ์แหล่งเตาเผาอินทขิลเมืองแกน/2-5.jpg" alt="" /></p>',
            'place_lat' => 19.187910,
            'place_lng' => 98.979812,
            'place_cover' => 'Cover-2017-12-20-5a394bf4d3014-Cover-2.jpg',
            'place_tagline' => 'แหล่งเตาเผาอินทขิลถือเป็นแหล่งโบราณคดีที่มีความสำคัญอย่างมากทั้งทางด้านวิชาการโบราณคดีและประวัติศาสตร์ความเป็นมาของอาณาจักรล้านนา',
//            'place_tag' => 'พิพิธภัณฑ์แหล่งเตาเผาอินทขิลเมืองแกน',
            'place_publishby' => 1,
            'place_status' => 1,
            'place_reader' => 40,
            'place_search' => 30,
            'place_switch' => 1,
            'created_at' => '2017-12-19 16:04:05',
            'updated_at' => Carbon::now(),
        ]);

        DB::table('places')->insert([
            'place_name_th' => 'ทุ่งดอกคอสมอส หนาวนี้ที่เมืองแกน เชียงใหม่',
            'place_name_eng' => 'Cosmos Flowers Chiang Mai',
            'place_address' => 'ตำบล อินทขิล อำเภอ แม่แตง เชียงใหม่ 50150',
            'place_detail' => '<p>แหล่งท่องเที่ยวแห่งใหม่ของเชียงใหม่ หนาวนี้ที่เมืองแกน เดินชมความงามของดอกคอสมอสบานเต็มทุ่ง ชมดอกไม้สวยๆ สัมผัสกับลมหนาว ชมวิถีชีวิตเรียบง่ายแต่สวยงามของชาวเมืองแกน ดอกคอสมอส หรือเรียกว่าดอกดาวกระจายพันธุ์ฝรั่งเศส ภาษาเหนือเรียกว่า ดอกคำแผ้แหล้ มีสีสันสวยงามทั้ง สีขาว สีชมพู และสีม่วง ตั้งอยู่เทศบาลเมืองเมืองแกนพัฒนา อำเภอแม่แตง จังหวัดเชียงใหม่</p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/ทุ่งดอกคอสมอส หนาวนี้ที่เมืองแกน เชียงใหม่/3-1.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/ทุ่งดอกคอสมอส หนาวนี้ที่เมืองแกน เชียงใหม่/3-2.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/ทุ่งดอกคอสมอส หนาวนี้ที่เมืองแกน เชียงใหม่/3-3.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/ทุ่งดอกคอสมอส หนาวนี้ที่เมืองแกน เชียงใหม่/3-4.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/ทุ่งดอกคอสมอส หนาวนี้ที่เมืองแกน เชียงใหม่/3-5.jpg" alt="" /></p>',
            'place_lat' => 19.1448566,
            'place_lng' => 98.9758924,
            'place_cover' => 'Cover-2017-12-20-5a394ccbac3d1-Cover-3.jpg',
            'place_tagline' => 'เทศการชมทุ่งดอกคอสมอสเริ่มมีให้ชมประมาณปลายเดือนธันวาคม- ต้นเดือนมกราคม ตั้งอยู่ที่เทศบาลเมืองเมืองแกนพัฒนา อำเภอแม่แตง จังหวัดเชียงใหม่ เบ่งบานเต็มพื้นที่กว่า 10 ไร่ ทั้งสีขาว สีม่วง และสีชมพู',
//            'place_tag' => 'ทุ่งดอกคอสมอส',
            'place_publishby' => 1,
            'place_status' => 1,
            'place_reader' => 100,
            'place_search' => 60,
            'place_switch' => 1,
            'created_at' => '2017-12-20 10:04:05',
            'updated_at' => Carbon::now(),
        ]);

        DB::table('places')->insert([
            'place_name_th' => 'ปางช้างแม่แตง',
            'place_name_eng' => 'Maetang Elephant Camp',
            'place_address' => '102 หมู่ 2 ตำบล กื้ดช้าง อำเภอ แม่แตง เชียงใหม่ 50150',
            'place_detail' => '<p>วันหยุดนี้ไปเที่ยวปางช้างแม่แตงกันครับ ไปชมการแสดงของช้างที่ถูกฝึกมาเป็นจำนวนมาก เริ่มแสดงรอบเช้า 9.30 น. ไปจนถึงช่วงบ่าย ชมการแสดงความสามารถและความน่ารัก เช่น ช้างเตะฟุตบอล ช้างวาดรูป การแสดงสาธิตของช้างงาน ช้างเล่นดนตรี ช้างออกกำลังกาย ที่ปางช้างแม่แตงมีนักท่องเที่ยวมาชมช้างกันเยอะมากครับโดยเฉพาะชาวต่างชาติ เค้าชอบดูช้างกันมาก</p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/ปางช้างแม่แตง/4-1.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/ปางช้างแม่แตง/4-2.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/ปางช้างแม่แตง/4-3.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/ปางช้างแม่แตง/4-4.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/ปางช้างแม่แตง/4-5.jpg" alt="" /></p>',
            'place_lat' => 19.2030611,
            'place_lng' => 98.8863883,
            'place_cover' => 'Cover-2017-12-20-5a394ea3563bd-Cover-4.jpg',
            'place_tagline' => 'เที่ยวปางช้างแม่แตง ชมการแสดงช้าง ขี่ช้าง นั่งเกวียน ล่องแพ เชียงใหม่',
//            'place_tag' => 'ปางช้างแม่แตง',
            'place_publishby' => 2,
            'place_status' => 1,
            'place_reader' => 30,
            'place_search' => 15,
            'place_switch' => 1,
            'created_at' => '2017-12-20 12:04:05',
            'updated_at' => Carbon::now(),
        ]);

        DB::table('places')->insert([
            'place_name_th' => 'แก่งกื้ด',
            'place_name_eng' => 'Whitewater Rafting',
            'place_address' => 'แก่งกื้ด แม่แตง เชียงใหม่ ',
            'place_detail' => '<p>แก่งกื้ด เป็นสถานที่เที่ยวทางน้ำยอดนิยม สำหรับชาวต่างชาติกับการมาล่องแก่งเรือยางกันที่นี่ครับ ท็อปเชียงใหม่จึงอยากแนะนำแก่งกึ๊ดไว้เป็นทางเลือกให้คุณในหน้าร้อนแบบนี้ครับ  ต่างชาติชอบล่องแก่งกัน ส่วนคนไทยส่วนใหญ่ชอบพาครอบครัวมาเล่นน้ำ ดูฝรั่งล่องแก่งผ่านไปมา….555  เพราะถึงแม้แก่งกึ๊ดจะเหมาะกับการทำกิจกรรมผาดโผน  แต่ก็มีหลายๆ จุดที่สามารถเล่นน้ำได้อย่างปลอดภัยครับ  ด้วยพื้นทรายนุ่มเท้ากับสายน้ำเย็นๆ  ท็อปเชียงใหม่อยากให้มาเที่ยวกันครับ</p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/แก่งกื้ด/5-1.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/แก่งกื้ด/5-2.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/แก่งกื้ด/5-3.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/แก่งกื้ด/5-4.jpg" alt="" /></p>
<p style="text-align: center;"><img class="img-fluid" src="/photos/1/แก่งกื้ด/5-5.jpg" alt="" /></p>',
            'place_lat' => 19.226025060241177,
            'place_lng' => 98.83459420629879,
            'place_cover' => 'Cover-2017-12-20-5a544ea3542bd-Cover-5.jpg',
            'place_tagline' => 'สถานที่ท่องเที่ยวกิจกรรมทางน้ำแห่งหนึ่งของจังหวัดเชียงใหม่ เป็นที่นิยมมากสำหรับชาวต่างชาติกับการมาล่องแก่งเรือยางกันที่นี่ สถานที่และบรรยากาศรอบๆห้อมล้อมด้วยธรรมชาติสวยงามมากๆ เป็นสถานที่มีผู้คนแวะเวียนมาไม่ขาดสาย',
//            'place_tag' => 'แก่งกื้ด',
            'place_publishby' => 2,
            'place_status' => 0,
            'place_reader' => 0,
            'place_search' => 0,
            'place_switch' => 0,
            'created_at' => '2017-12-20 16:04:05',
            'updated_at' => Carbon::now(),
        ]);

    }
}
