<?php

use Illuminate\Database\Seeder;
use Faker\Factory as Faker;
use Carbon\Carbon;
use Illuminate\Support\Facades\Storage;

class WisdomTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('wisdoms')->insert([
            'wisdom_name_th' => 'โคมไฟ 700 ปี',
            'wisdom_name_eng' => 'ComFrie 700 Year',
            'wisdom_address' => 'บ้านม่วงคำ อำเภอแม่แตง จังหวัดเชียงใหม่',
            'wisdom_detail' => '<p><img class="img-fluid" src="/photos/1/โคมไฟ 700 ปี/DSC06746.JPG" alt="" /></p>
<p>&nbsp;</p>
<p><span lang="TH">การส่งและการพัฒนาอาชีพของเกษตรให้ยกระดับมาตรฐานและมีความมั่นคงจากเดิมนั้นนับว่าเป็นปัจจัยหลักสำคัญในการพัฒนาประเทศให้มีความก้าวหน้าเมื่อประชากรประเทศมีความมั่นคงมากขึ้น เสถียรภาพต่างๆที่เอื้ออำนวยต่อความเจริญก็ตามมาด้วยแต่การที่จะพัฒนาบุคคลเหล่านี้ให้มีศักยภาพและเข้มแข็งจำเป็นอย่างยิ่งที่ต้องอาศัยความร่วมมือจากหลายๆฝ่าย ซึ่งที่ผ่านมารัฐบาลได้เข้ามาดำเนินการเผยแพร่ความรู้ที่มีประโยชน์ในการครองชีพต่างๆมากมาย ทั้งการส่งเสริมเทคโนโลยีและนวัตกรรมที่ทันสมัย การดำเนินโครงการพัฒนาต่างๆ การรวมเกษตรในการผลิตสินค้าในด้านการเกษตร แต่การที่จะยกระดับสินค้าและผลิตภัณฑ์ของเกษตรกรให้ผู้บริโภคมีความเชื่อมั่นนั้นต้องอาศัยความเชื่อมั่นและมาตรฐานที่ดีของสินค้า เช่นเดียวกันกับโคมไฟ&nbsp;</span>700<span lang="TH">&nbsp;ปีผลิตภัณฑ์โอทอปขึ้นชื่อของบ้านม่วงคำ อำเภอแม่แตง จังหวัดเชียงใหม่</span></p>
<p><span lang="TH">การสำรวจและการศึกษาค้นคว้าหาข้อมูลและการสัมภาษณ์ผู้ประดิษฐ์ โคมไฟ&nbsp;700&nbsp;ปีพบว่าจากการเริ่มต้นการทำโคมไฟ&nbsp;700&nbsp;ปี ไม่ค่อยมีผู้สนใจมากนัก เพราะเห็นว่าเป็นเรื่องล้าสมัยและไม่มีรายได้ ประชาชนส่วนใหญ่มีอาชีพทำไร่ ทำสวน จึงไม่เห็นความสำคัญมากนัก</span></p>
<p><span lang="TH">นายประพันธ์ ใจคำ หรือ ลุงน้อย ผู้คิดค้นการทำโคมไฟ&nbsp;700&nbsp;ปี เล่าให้ฟังว่า เหตุที่ประดิษฐ์ของประดับตกแต่งบ้านเป็นโคมไฟ&nbsp;700&nbsp;ปีนี้ มีแนวคิดจากการดัดแปลงหมวกใบลานของคนภาคเหนือ ซึ่งเป็นหมวกดั้งเดิมของคนเมือง เริ่มทำตั้งแต่ พ.ศ.&nbsp;2543&nbsp;โดยใช้เงินลงทุนส่วนตัวในการผลิตสินค้า ในระยะแรกยังไม่มีตลาดมากเท่าที่ควรตนจึงต้องเดินหาบเร่จำหน่ายสินค้า จากนั้นในปี พ.ศ.&nbsp;2544ได้เข้ามากู้เงินทุนหมู่บ้านได้เงินลงทุนมาทั้งสิ้น&nbsp;5,000&nbsp;บาท แต่ข้อตกลงของหมู่บ้านให้กู้ได้เพียงปีต่อปีเท่านั้น</span></p>
<p style="font-weight: 400;">ส่วนการตั้งชื่อโคมไฟ&nbsp;700&nbsp;ปีนั้น ตนได้มีโอกาสนำผลิตภัณฑ์ไปจำหน่ายในงานเฉลิมฉลองครบรอบ700&nbsp;ปีของจังหวัดเชียงใหม่ ทำให้เกิดแรงบันดาลใจต้องการที่จะทำบุญร่วมในวันงานเฉลิมฉลอง700&nbsp;ปี จึงได้อธิษฐานและร่วมทำบุญ เกิดความคิดที่จะนำอายุของเมืองเชียงใหม่&nbsp;700&nbsp;ปี มาตั้งเป็นชื่อ โคมไฟ&nbsp;700&nbsp;ปี เพื่อให้เกิดความเป็นสิริมงคล จากนั้นในปี&nbsp;2546<strong>&nbsp;</strong>ได้นำผลิตภัณฑ์เข้าร่วมโครงการคัดสรรสุดยอดหนึ่งตำบลหนึ่งผลิตภัณฑ์ ซึ่งโคมไฟ&nbsp;700&nbsp;ปี ผ่านการคัดสรรอยู่ในระดับ&nbsp;3&nbsp;ดาวของภาคเหนือ ซึ่งคัดจาก&nbsp;17&nbsp;จังหวัดภาคเหนือ และในปี&nbsp;2547&nbsp;ตนได้นำผลิตภัณฑ์เข้าร่วมการคัดสรรอีกครั้ง ซึ่งเป็นคัดสรรสุดยอดหนึ่งตำบลหนึ่งผลิตภัณฑ์ระดับประเทศได้&nbsp;2&nbsp;ดาว ตั้งแต่นั่นมาจึงได้เร่งดำเนินการพัฒนาภูมิปัญญาและผลงานอยู่เสมอเพื่อให้ตรงกับความต้องการของลูกค้าและมีความทันสมัยมากขึ้นประกอบกับประสบการณ์ที่มีอยู่เดิมทำให้ทุกรายละเอียดของชิ้นงานมีมาตรฐาน สวยงามและคงทนมากขึ้น&nbsp;ผู้ประดิษฐ์โคมไฟ&nbsp;700&nbsp;ปี กล่าวเพิ่มเติมว่า ในปัจจุบันนี้ได้กระจายความรู้และงานไปยังกลุ่มผู้สูงอายุให้มาร่วมกิจกรรมเพื่อเป็นการใช้เวลาว่างให้เป็นประโยชน์ และเป็นการสร้างานสร้างอาชีพเพิ่มรายได้ให้กับกลุ่มผู้สูงอายุใน&nbsp;7&nbsp;หมู่บ้านด้วย ส่วนเรื่องของตลาดนั้น ขณะนี้มีตลาดรับซื้อหลักอยู่ที่ตลาดจตุจักรกรุงเทพมหานคร บ้านถวาย และร้านวนัสนันท์เชียงใหม่ ซึ่งจะส่งจำหน่ายครั้งละ&nbsp;200-250&nbsp;ชิ้น ถือว่าเป็นอีกหนึ่งความสำเร็จที่ตนภาคภูมิใจมาก เพราะทุกหยาดเหงื่อที่ต่อสู้มาจนถึงจุดนี้ มีคุณค่าไม่เสียเปล่า อีกทั้งยังช่วยให้ผู้สูงอายุในหมู่บ้านมีรายได้เพิ่มไม่เป็นภาระแก่บุตรหลานด้วย</p>
<p style="font-weight: 400;">&nbsp;</p>
<p style="font-weight: 400;">ที่มา&nbsp;<a href="http://comfrie700yearchiangmai.blogspot.com/">http://comfrie700yearchiangmai.blogspot.com/</a></p>',
            'wisdom_lat' => 19.1565535,
            'wisdom_lng' => 99.0087114,
            'wisdom_cover' => 'Cover-2019-02-11-5c61309175f51-DSC06746.JPG',
            'wisdom_tagline' => 'โคมไฟ 700 ปี มีแนวคิดจากการดัดแปลงหมวกใบลานของคนภาคเหนือ',
//            'wisdom_tag' => 'การทำร่มด้วยกระดาษสา',
            'wisdom_publishby' => 1,
            'wisdom_status' => 1,
            'wisdom_reader' => 35,
            'wisdom_search' => 15,
            'wisdom_switch' => 1,
            'created_at' => '2018-09-06 15:42:10',
            'updated_at' => Carbon::now(),
        ]);


        DB::table('wisdoms')->insert([
            'wisdom_name_th' => 'ผ้าทอลายเงี้ยวก้นหม่น',
            'wisdom_name_eng' => 'Woven Fabric',
            'wisdom_address' => 'อำเภอแม่แตง จังหวัดเชียงใหม่',
            'wisdom_detail' => '<h3 style="text-align: center;"><strong><img class="img-fluid" src="/photos/1/ผ้าทอลายเงี้ยวก้นหม่น/448a94929572d9bc18fb57fc52089fb51351283467.jpg" alt="" /></strong></h3>
<h3><strong>ประวัติความเป็นมา</strong></h3>
<p>การทอผ้าเป็นวัฒนธรรมวิถีชีวิตแบบพื้นบ้าน ที่มีมานานของชนชาติพันธุ์อำเภอแม่แตง ประกอบด้วยหลากหลายชาติพันธุ์เช่น เงี้ยว ไทใหญ่ มูเซอ ลีซอ กระเหรื่ยง ฯลฯ เงี้ยวเป็นชนชาติหนึ่งที่มีการทอผ้า โดยใช้ภูมิปัญญาดั้งเดิม โดยนำใยเชือกกล้วยมาถักทอเป็นเครื่องนุ่งห่ม จากชิ้นเล็กนำมาต่อกันเป็นชิ้นใหญ่ ตั้งแต่อดีตมาจนถึงปัจจุบัน จนกลายเป็นภูมิปัญญาพื้นบ้านที่แฝงถึงเรื่องราววิถีชีวิตของคนสมัยก่อนที่นำวัตถุดิบจากธรรมชาติมาใช้ประโยชน์ นำให้เกิดความภาคภูมิใจในคุณค่าของผ้าทอลายเงี้ยวก้นหม่น</p>
<h3><strong>อัตลักษณ์(เอกลักษณ์)/จุดเด่นของผลิตภัณฑ์</strong></h3>
<p>จุดเด่นของผลิตภัณฑ์มีดังนี้คือ<br />1.สีสันของผ้าทอจะมีความคล้ายคลึงกับสีของธรรมชาติแม้ว่าจะย้อมจากสีสังเคราะห์และย้อมจากสีธรรมชาติ เช่น แกนขนุนใบหูกวาง ซึ่งมีความทนทาน<br />2.ลวดลายจะเกี่ยวข้องกับธรรมชาติ ซึ่งแม่แตงมีภูมิประเทศเป็นภูเขาต้นไม้ แม่น้ำ ลวดลายที่โดดเด่นเช่น ลายน้ำไหล หน่อไม้ สายฝน ดอกหญ้า ซึ่งไม่เหมือนใคร ลวดลายมีความกลมกลืนกับธรรมชาติรอบตัว<br />3.ลายเงี้ยวก้นหม่นจะมีสีสันของลวดลายฝ้ายผสมผสานกันระหว่างสีดำกับสีอื่นๆหรือ สีสันที่มีโทนเดียวกันโดยเรียกว่า การปั่นไก ซึ่งเป็นอัตลักษณ์อย่างหนึ่งของฝ้าทอลายเงี้ยวก้นหม่น</p>
<h3>มาตรฐานและรางวัลที่ได้รับ</h3>
<p>OTOP ระดับ 3 ดาว ประจำปี 2553</p>
<h3>ความสัมพันธ์กับชุมชน</h3>
<p>ความสัมพันธ์กับชุมชนมีดังนี้คือ<br />1.การใช้เวลาว่างให้เป็นประโยชน์หลังจากการว่างเว้นจากการทำการเกษตรกรรม เช่น การทำนา ทำไร่ ทำสวน เป็นการส่งเสริมให้ครอบครัวมีความเป็นอยู่ที่ดีขึ้น ครอบครัวมีรายได้เสริม ครอบครัวอบอุ่น และยังเป็นการสืบสานภูมิปัญญาท้องถิ่นไว้ให้ลูกหลานได้สืบต่อไปในอนาคตต่อไป<br />2.เกิดความสามัคคีภายในกลุ่มหมู่บ้านและชุมชน เป็นการทำกิจกรรมร่วมกันระหว่างคนหลายวัยในชุมชน รวมถึงบ้าน วัด โรงเรียน เพราะการทอผ้าเป็นการแสดงถึงวัฒนธรรม ภูมิปัญญาของคนในอดีต ที่เล่าถึงเรื่องราวประวัติศาสตร์ ความเป็นมาของชนชาติของตนมาจนถึงปัจจุบัน ที่สามารถสืบค้นจับต้องได้ซึ่งเป็นการแสดงถึงความเจริญงอกงามของภูมิปัญญาของคนในท้องถิ่นได้เป็นอย่างดี</p>
<h2>กระบวนการผลิต</h2>
<p>&nbsp;</p>
<h3>วัตถุดิบและส่วนประกอบ</h3>
<p>- ฝ้ายไหมเมือง<br />- ฝ้ายไหมประดิษฐ์<br />- สีย้อมผ้าสังเคราะห์<br />- สีย้อมจากธรรมชาติ เช่น แกนขนุน ยางกล้วย ใบหูกวาง<br />- กี่ทอผ้า กี่กระตุก<br />- กงก้างหางเห็น(ใช้ปั่นฝ้าย)</p>
<h3>ขั้นตอนการผลิต</h3>
<p>1. ปั่นฝ่ายออกมาเป็นเส้นด้ายด้วยเครื่องปั่นฝ้าย<br />2. นำเส้นฝ้ายที่ได้ ไปย้อมโดยการต้มน้ำให้เดือด ซึ่งขั้นตอนนี้จะต้องใช้ความสามารถและทักษะเฉพาะตัวของผู้ที่มีความชำนาญในการย้อม เพราะสีของฝ้ายที่ย้อมจะทำลวดลายอยู่ในขั้นตอนนี้<br />3. นำฝ้ายที่ได้จากการย้อมสีไปตากให้แห้งในที่ร่ม ห้ามตากแดด แล้วนำไปใส่กี่ทอผ้าหรือกี่กระตุก<br />4. ทอด้วยกี่กระตุก หรือกี่ทอผ้าด้วยมือ</p>
<p>&nbsp;</p>
<h3>เทคนิค/เคล็ดลับในการผลิต</h3>
<p>1.การย้อมสีแดงจะย้อมน้ำเดียวต้องต้มนานๆจนกว่าน้ำสีในหม้อจะเปลี่ยนเป็นสีจางๆเพราะฝ้ายจะดูดซึมสีเข้าไป<br />2.การย้อมสีให้ทนสวยงามนานจะเอาฝ้ายย้อมสีตากในร่วม ถ้าตากแดดจะตายสีเร็ว<br />3.การทอผ้าให้มีความสวยงามอยู่ที่การออกแบบลวดลายการย้อมต้องใช้สีตามธรรมชาติ การลงน้ำหนักให้การทอแต่ละครั้งต้องมีความสม่ำเสมอ จึงทำให้ผ้าเรียบแน่นและทนสวยงาม</p>
<p>&nbsp;</p>
<p>ที่มา&nbsp;<a href="http://www.otoptoday.com/wisdom/6334/%E0%B8%9C%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%AD%E0%B8%A5%E0%B8%B2%E0%B8%A2%E0%B9%80%E0%B8%87%E0%B8%B5%E0%B9%89%E0%B8%A2%E0%B8%A7%E0%B8%81%E0%B9%89%E0%B8%99%E0%B8%AB%E0%B8%A1%E0%B9%88%E0%B8%99">http://www.otoptoday.com/wisdom/6334/%E0%B8%9C%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%AD%E0%B8%A5%E0%B8%B2%E0%B8%A2%E0%B9%80%E0%B8%87%E0%B8%B5%E0%B9%89%E0%B8%A2%E0%B8%A7%E0%B8%81%E0%B9%89%E0%B8%99%E0%B8%AB%E0%B8%A1%E0%B9%88%E0%B8%99</a></p>',
            'wisdom_lat' => 19.14730524374309,
            'wisdom_lng' => 99.00331693139651,
            'wisdom_cover' => 'Cover-2019-02-11-5c6135b2789bf-493470069.jpg',
            'wisdom_tagline' => 'ผ้าทอลายเงี้ยวก้นหม่น สีสันของผ้าทอจะมีความคล้ายคลึงกับสีของธรรมชาติ',
//            'wisdom_tag' => 'หมู่บ้านถวาย',
            'wisdom_publishby' => 2,
            'wisdom_status' => 1,
            'wisdom_reader' => 70,
            'wisdom_search' => 20,
            'wisdom_switch' => 1,
            'created_at' => '2018-09-06 15:45:16',
            'updated_at' => Carbon::now(),
        ]);
    }
}
